packages.dot
digraph "packages" {
charset="utf-8"
rankdir=BT
"0" [label="smoothprogressbar", shape="box"];
"1" [label="smoothprogressbar.__about__", shape="box"];
"2" [label="smoothprogressbar.__config__", shape="box"];
"3" [label="smoothprogressbar.console", shape="box"];
"4" [label="smoothprogressbar.consolelabel", shape="box"];
"5" [label="smoothprogressbar.consolepercent", shape="box"];
"6" [label="smoothprogressbar.consoleprgbr", shape="box"];
"7" [label="smoothprogressbar.consoleprogress", shape="box"];
"8" [label="smoothprogressbar.consolestring", shape="box"];
"9" [label="smoothprogressbar.elapse", shape="box"];
"10" [label="smoothprogressbar.multithreading", shape="box"];
"11" [label="smoothprogressbar.percent", shape="box"];
"12" [label="smoothprogressbar.prgbr", shape="box"];
"0" -> "1" [arrowhead="open", arrowtail="none"];
"0" -> "3" [arrowhead="open", arrowtail="none"];
"0" -> "4" [arrowhead="open", arrowtail="none"];
"0" -> "7" [arrowhead="open", arrowtail="none"];
"0" -> "8" [arrowhead="open", arrowtail="none"];
"0" -> "9" [arrowhead="open", arrowtail="none"];
"0" -> "10" [arrowhead="open", arrowtail="none"];
"0" -> "11" [arrowhead="open", arrowtail="none"];
"0" -> "12" [arrowhead="open", arrowtail="none"];
"4" -> "8" [arrowhead="open", arrowtail="none"];
"5" -> "0" [arrowhead="open", arrowtail="none"];
"5" -> "2" [arrowhead="open", arrowtail="none"];
"5" -> "8" [arrowhead="open", arrowtail="none"];
"6" -> "0" [arrowhead="open", arrowtail="none"];
"6" -> "2" [arrowhead="open", arrowtail="none"];
"6" -> "4" [arrowhead="open", arrowtail="none"];
"6" -> "5" [arrowhead="open", arrowtail="none"];
"6" -> "7" [arrowhead="open", arrowtail="none"];
"6" -> "8" [arrowhead="open", arrowtail="none"];
"6" -> "11" [arrowhead="open", arrowtail="none"];
"7" -> "0" [arrowhead="open", arrowtail="none"];
"7" -> "2" [arrowhead="open", arrowtail="none"];
"7" -> "8" [arrowhead="open", arrowtail="none"];
"11" -> "8" [arrowhead="open", arrowtail="none"];
"12" -> "0" [arrowhead="open", arrowtail="none"];
"12" -> "2" [arrowhead="open", arrowtail="none"];
"12" -> "3" [arrowhead="open", arrowtail="none"];
"12" -> "6" [arrowhead="open", arrowtail="none"];
"12" -> "9" [arrowhead="open", arrowtail="none"];
"12" -> "10" [arrowhead="open", arrowtail="none"];
"12" -> "11" [arrowhead="open", arrowtail="none"];
}
